---
kind: other
id: Methods.T:Autodesk.Revit.DB.Sketch
source: html/c19bf431-0787-f0cc-e895-99cb03491425.htm
---
# Sketch Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.